[{"Class":"INFO","Number":343,"Class_Title":"Client-side Web Development","Quarter":"Autumn","Year":2015,"GPA":"3.8","Description":"Introduction to client-side web development including markup, programming, protocols, libraries, frameworks, and techniques for creating effective, usable, dynamic, and responsive applications that meet user needs. Includes an introduction to web development roles within organizations, content management systems, and other tools to build and manage websites and applications"},
{"Class":"INFO","Number":360,"Class_Title":"Design Thinking","Quarter":"Autumn","Year":2015,"GPA":"3.7","Description":"Introduces design methods for identifying user needs, devising new design concepts, prototyping these concepts, and evaluating their utility and usability. Introduces the theory and practice of user-centered design. Examines methods for identifying users' needs, understanding users' behaviors, envisioning and prototyping new systems, and evaluating the usability of systems. Emphasis on incorporating people in the design process from initial field observations to summative usability testing."},
{"Class":"INFO","Number":424,"Class_Title":"Info Visualization and Aesthetics","Quarter":"Autumn","Year":2015,"GPA":"3.8","Description":"No Description Available"},
{"Class":"CSE","Number":142,"Class_Title":"Computer Programing 1","Quarter":"Spring","Year":2015,"GPA":"3.6","Description":"Basic programming-in-the-small abilities and concepts including procedural programming (methods, parameters, return, values), basic control structures (sequence, if/else, for loop, while loop), file processing, arrays, and an introduction to defining objects. Intended for students without prior programming experience."},
{"Class":"PSYCH","Number":209,"Class_Title":"Research Methods of Psychology","Quarter":"Spring","Year":2015,"GPA":"3.4","Description":"Psychological research methodology and techniques. Topics include the logic of hypothesis testing, experimental design, research strategies and techniques, fundamentals of scientific writing, search and evaluation of research literature in psychology, and ethical issues in psychological research. Required for all psychology majors."},
{"Class":"CSE","Number":190,"Class_Title":"Special Topics in CSE","Quarter":"Spring","Year":2015,"GPA":"CR","Description":"No Description Available"},
{"Class":"ESS","Number":495,"Class_Title":"NASA Research Seminar","Quarter":"Spring","Year":2015,"GPA":"CR","Description":"Review of current space science-related research. Emphasis varies, but topics may include planetary geology, astronomy, global change, aeronautical engineering, and remote sensing."},
{"Class":"INFO","Number":200,"Class_Title":"Intell Foundations","Quarter":"Winter","Year":2015,"GPA":"4","Description":"Information as an object of study, including theories, concepts, and principles of information, information seeking, cognitive processing, knowledge representation and restructuring, and their relationships to physical and intellectual access to information. Development of information systems for storage, organization, and retrieval. Experience in the application of theories, concepts, and principles."},
{"Class":"PSYCH","Number":202,"Class_Title":"Biopsychology","Quarter":"Winter","Year":2015,"GPA":"3.7","Description":"Examines the biological basis of behavior, the nervous system, how it works to control behavior and sense the world, and what happens when it malfunctions. Topics include learning and memory, development, sex, drugs, sleep, the senses, emotions, and mental disorders."},
{"Class":"STAT","Number":221,"Class_Title":"Statistics for Social Sciences","Quarter":"Winter","Year":2015,"GPA":"3.4","Description":"Develops statistical literacy. Examines objectives and pitfalls of statistical studies; study designs, data analysis, inference; graphical and numerical summaries of numerical and categorical data; correlation and regression; and estimation, confidence intervals, and significance tests. Emphasizes social science examples and cases. "},
{"Class":"INFO","Number":101,"Class_Title":"Social Networking","Quarter":"Winter","Year":2014,"GPA":"4","Description":"Explores today's most popular social networks, gaming applications, and messaging applications. Examines technologies, social implications, and information structure. Focuses on logic, databases, networked delivery, identity, access privacy, ecommerce, organization, and retrieval."},
{"Class":"MUSIC","Number":331,"Class_Title":"History of Jazz","Quarter":"Autumn","Year":2014,"GPA":"3.5","Description":"No Description Available"},
{"Class":"SCAND","Number":367,"Class_Title":"Human Sexuality in Scandinavia","Quarter":"Autumn","Year":2014,"GPA":"3.7","Description":"Examines selected Scandinavian literary and socio-political texts, films, and art to manifest the reality behind the myths of sexual freedom in Scandinavia."},
{"Class":"ART","Number":201,"Class_Title":"Ceramic Handbuilding","Quarter":"Spring","Year":2014,"GPA":"3.7","Description":"Introduces hand-forming and glazing as a means to explore functional and conceptual considerations with clay in a contemporary context and art practice."},
{"Class":"GERMAN","Number":103,"Class_Title":"First-Year German","Quarter":"Spring","Year":2014,"GPA":"3.3","Description":"The methods and objectives are primarily communicative, with emphasis on speaking and listening. Secondary objectives are reading and writing. Third in a sequence of three."},
{"Class":"MUSIC","Number":162,"Class_Title":"Writing- American Popular Music","Quarter":"Spring","Year":2014,"GPA":"3.9","Description":"Historical, social, and stylistic study of popular idioms from the late nineteenth century to the present. Most attention to contemporary idioms (rock, country-western, soul, hip-hop). Various facets of the industry examined to learn how they influence taste and musical style."},
{"Class":"GERMAN","Number":102,"Class_Title":"First-Year German","Quarter":"Winter","Year":2014,"GPA":"3.5","Description":"The methods and objectives are primarily communicative, with emphasis on speaking and listening. Secondary objectives are reading and writing. Second in a sequence of three. "},
{"Class":"ASTR","Number":150,"Class_Title":"The Planets","Quarter":"Autumn","Year":2013,"GPA":"3.2","Description":"For liberal arts and beginning science students. Survey of the planets of the solar system, with emphases on recent space exploration of the planets and on the comparative evolution of the Earth and the other planets. "},
{"Class":"ESS","Number":102,"Class_Title":"Space & Space Travel","Quarter":"Autumn","Year":2013,"GPA":"3.5","Description":"Explores the sun, solar storms, observations from space and from Earth; Earth's space environment, radiation belts and hazards, plasma storms and auroras, rockets and propulsion, human exploration efforts, societal impact, planetary systems and resources, and project highlighting space and its exploration."},
{"Class":"GERMAN","Number":101,"Class_Title":"First-Year German","Quarter":"Autumn","Year":2013,"GPA":"3.2","Description":"The methods and objectives are primarily communicative, with emphasis on speaking and listening. Secondary objectives are reading and writing. "},
{"Class":"GEN ST","Number":199,"Class_Title":"University Community","Quarter":"Autumn","Year":2013,"GPA":"CR","Description":"Introduces students to various aspects of the University of Washington community. Includes exploration of university resources and opportunities, and academically related skill development."}]